#+title: C code samples

#+PROPERTY: header-args:C :results output ##:includes <stdio.h>

#+begin_src C :exports both
int main() {
    printf("a thing\n");
}
#+end_src

#+RESULTS:
: a thing


#+begin_src C :exports both
int main() {
    printf("Hey dave");
}
#+end_src

#+RESULTS:
: Hey dave
